##                                  Section 1

#### 1. The average selling price of a food item in a restaurant is Rs 250.00 and the standard deviation of the price is Rs 47.00. The median value is an indication of the central value of the data and is close to the mean of Rs 202.00. If you know these details, will you become a regular customer of the restaurant?

In [2]:
# average price of a food item (mean)= Rs.250
print("mean=Rs.",250)
# Median Vavlue of food item = Rs.202
print("median=Rs.",202)
# Std deviation of price = Rs.47
print("std_deviation=Rs.",47)

mean = 250.00
standard_deviation = 47.00
average_price_of_item = 202.00  #considering median as average selling price of food item

z_score = (average_price_of_item - mean) / standard_deviation
print("Z-score:", z_score)

# Assuming,
if -1 <= z_score <= 1:
    print("Prices of items falls in acceptable range.")
else:
    print("Prices of items does not fall in acceptable range.")

mean=Rs. 250
median=Rs. 202
std_deviation=Rs. 47
Z-score: -1.0212765957446808
Prices of items does not fall in acceptable range.

**Conclusion:-**

***Although data seems to be incomplete to draw any conclusion as we will require some sample data on the basis of which judgemnent can be passed. Given data suggest that standard deviation is less but on the other hand median is lesser than mean which says prices of few items are relatively higher and data is positively skewed. The final decision making will have to take few other factors into consideration. Apparently I am personally not going to become a regular customer of this restaurant if there are other better options comparatively***

In [66]:
####################################################################################################################

#### 2. In a residential locality, the average size of a house is 2224 square feet with a standard deviation of 248 square feet which indicates that the distribution of size is fairly the same across the data and the median value of the house is 2220 square feet. Does the locality have bigger or smaller-sized houses?

In [8]:
#average size of house = 2224 sq.ft
print('mean=',2224)
#median value of house = 2220 sq.ft
print('median=',2220)
#standard deviation of house = 248 sq.ft
print('std_deviation=',248)

# Here,
mean= 2224
median= 2220
if mean>median:
    print("The mean size of house is greater than median value of houses")
else:
    print("The mean size of house is lesser or equal to median value of houses")

mean= 2224
median= 2220
std_deviation= 248
The mean size of house is greater than median value of houses

**Conclusion:-**

***As mentioned in the question that standard deviation is lesser, thus data falls approximately in normal distribution. Also mean size of houses is greater than median value thus we can infer that locality have some bigger sized houses. However predictions can be done using this, but if we have to come at solid conclusion we will require range and few sample sizes in this data***

In [67]:
###########################################################################################################################

#### 3. You want to invest in real estate, and you have the data belonging to locality X and Y. Some of the house prices in locality X are 2.00 L,10.00 L, 8.00 L, and 12.00 L and the prices of houses in Y are 2.5 L, 9.50 L, 8.15 L, and 12.50 L. Conduct a statistical measure to decide which locality is best for investment.

In [1]:
import pandas as pd

# Prices in locality X
price_x= pd.Series([2.00, 10.00, 8.00, 12.00])

# Prices in locality Y
price_y = pd.Series([2.5, 9.50, 8.15, 12.50])

# Lets calculate the mean prices of houses in each locality
print("Mean house price in locality X:", price_x.mean())
print("Mean house price in locality Y:", price_y.mean())

# Calculate the median prices of houses in each locality
print("Median house price in locality X:", price_x.median())
print("Median house price in locality Y:", price_y.median())

# Calculate the standard deviation of prices of houses in each locality for dispersion of data
print("Std_deviation of house price in locality X:", price_x.std())
print("Std_deviation of house price in locality Y:", price_y.std())

Mean house price in locality X: 8.0
Mean house price in locality Y: 8.1625
Median house price in locality X: 9.0
Median house price in locality Y: 8.825
Std_deviation of house price in locality X: 4.320493798938574
Std_deviation of house price in locality Y: 4.189943317039027

**Conclusion:-**

***1.The mean prices of houses at locality X is slightly lesser than locality Y.The standard deviation of prices of houses at locality X is slightly higher than locality Y. The median prices of houses at locality X is higher than locality Y. We can conclude that Locality X has highly dispersed data and wide range of houses available and median value is higher so this locality has better value in appreciation of real estate. However other factors like market, other facilities at location, one's personal reason behind investment plays a vital role in decision making. Those who are looking for cheaper properties can opt for locality Y***

In [68]:
###################################################################################################################

#### 4. During a survey, the ages of 80 patients, infected by COVID and admitted to one of the city hospitals, were recorded. The collected data is represented in the less-than-cumulative frequency distribution table. Read the questions below the table and provide your answers.

In [19]:
df = pd.DataFrame(
    {
        "Age": ["5-15", "15-25", "25-35","35-45","45-55","55-65"],
        "Num_of_patients": [6,11,21,23,14,5],
    }
)
df

     Age  Num_of_patients
0   5-15                6
1  15-25               11
2  25-35               21
3  35-45               23
4  45-55               14
5  55-65                5

In [41]:
# Que1. Which class interval has the highest frequency?
#Soln:-
highest_frequency=df["Num_of_patients"].idxmax()
Highest_frequency_class_interval=df.loc[highest_frequency,'Age']
print("Class interval with highest frequency is",Highest_frequency_class_interval)

#Que2. Which age was affected the least?
#Soln:-
lowest_frequency=df["Num_of_patients"].idxmin()
Lowest_frequency_class_interval=df.loc[lowest_frequency,'Age']
print("Age which was affected the least is",Lowest_frequency_class_interval)

#Que3. How many patients of age 45 years and above were admitted?
#Soln:-
# Dataframe for people above age of 45 years
New_df=df[df["Age"] >= '45-55']
Total_num_of_patients=New_df["Num_of_patients"].sum()
print("patients of age 45 years and above admitted were",Total_num_of_patients)

#Que4. Which is the modal class interval in the above dataset?
#Soln:-
highest_frequency=df["Num_of_patients"].idxmax()
Highest_frequency_class_interval=df.loc[highest_frequency,'Age']
print("Modal class interval is",Highest_frequency_class_interval)

Class interval with highest frequency is 35-45
Age which was affected the least is 55-65
patients of age 45 years and above admitted were 25
Modal class interval is 35-45

In [12]:
#Que5. What is the median class interval of age?
#Soln:-
# Approximating median by pure python and pandas functions
import pandas as pd

df = pd.DataFrame.from_dict({'low_range':[5,16,26,36,46,56], 'high_range':[15,25,35,45,55,65], 'Num_of_patients':[6,11,21,23,14,5]})

N = df['Num_of_patients'].sum()
# calulating L1
index = abs(df['Num_of_patients'].cumsum() - N/2).idxmin()
L1 = df['low_range'][index + 1]
cumsum_before = df['Num_of_patients'].cumsum()[index]
freq_median = df['Num_of_patients'][index + 1]
width = df['high_range'][index + 1] - df['low_range'][index + 1]  + 1

median = L1 + (N/2 - cumsum_before ) / freq_median * width

print("L1 = {} , cumsum_before = {}, freq_medain = {}, width = {}".format(L1, cumsum_before, freq_median, width ) )
print("Approximated median = ", median)



#This solution has been learnt from google solutions. Requires due attention

L1 = 36 , cumsum_before = 38, freq_medain = 23, width = 10
Approximated median =  36.869565217391305

In [69]:
######################################################################################################################

#### 5. Assume, you are a trader and have invested over the years for your retirement. Lately, with the fluctuating economical condition, you are worried about the average return on investment. What average method is appropriate to compute the average return for the data given in the table?

In [44]:
df1 = pd.DataFrame(
    {
        "Year": [2015,2016,2017,2018,2019,2020],
        "Return_in_%": [36,23,-48,-30,15,31],
        "Asset_Price": [5000,6400,7890,9023,4567,3890]
    }
)
df1

   Year  Return_in_%  Asset_Price
0  2015           36         5000
1  2016           23         6400
2  2017          -48         7890
3  2018          -30         9023
4  2019           15         4567
5  2020           31         3890

In [47]:
# We are going to use arithmetic mean method for calculating mean as there are negative values in return
average_return_percent =df1['Return_in_%'].mean()
print("average return on investment is",average_return_percent)

average return on investment is 4.5

In [72]:
#####################################################################################################################

#### 6. Suppose you have been told to measure the height of all men on the earth. What strategy would you use?

**Conclusion:-**

***Sampling method would be more appropriate to evaluate the height of all men on earth. We can take proper sample from various regions, age group, lifestyle, etc and calculate the average height of all the men on earth and thus giving broad view about required attribute.***

In [71]:
#####################################################################################################################

#### 7. Calculate the z score of the following numbers:
X = [4.5,6.2,7.3,9.1,10.4,11]

In [10]:
import pandas as pd
import scipy.stats as stats

X = pd.Series([4.5, 6.2, 7.3, 9.1, 10.4, 11])

z_scores= stats.zscore(X)

print("Z-scores:\n",z_scores)

Z-scores:
 0   -1.553856
1   -0.816678
2   -0.339680
3    0.440861
4    1.004586
5    1.264767
dtype: float64

In [73]:
#####################################################################################################################

## Section 2

In [19]:
import pandas as pd
import numpy as np

df3=pd.read_excel(r"C:\Users\ASUS\Desktop\Python Week 4\Bank_Personal_Loan_Modelling.xlsx")
df3.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1

#### 8. Give the statistical summary for all the variables in the dataset.

In [31]:
df3[['Age','Experience','Income','Family','CCAvg','Mortgage',"Personal Loan"]].describe()

,Age,Experience,Income,Family,CCAvg,Mortgage,Personal Loan
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000
mean,45.338400,20.104600,73.774200,2.396400,1.937913,56.498800,0.096000
std,11.463166,11.467954,46.033729,1.147663,1.747666,101.713802,0.294621
min,23.000000,-3.000000,8.000000,1.000000,0.000000,0.000000,0.000000
25%,35.000000,10.000000,39.000000,1.000000,0.700000,0.000000,0.000000
50%,45.000000,20.000000,64.000000,2.000000,1.500000,0.000000,0.000000
75%,55.000000,30.000000,98.000000,3.000000,2.500000,101.000000,0.000000
max,67.000000,43.000000,224.000000,4.000000,10.000000,635.000000,1.000000

In [74]:
#####################################################################################################################

#### 9. Give all the measures of central tendency for all the quantitative variables which are continuous and discrete.

In [4]:
Mean_Median= df3.agg(['mean','median'])
Mean_Median

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
mean,2500.5,45.3384,20.1046,73.7742,93152.503,2.3964,1.937913,1.881,56.4988,0.096,0.1044,0.0604,0.5968,0.294
median,2500.5,45.0000,20.0000,64.0000,93437.000,2.0000,1.500000,2.000,0.0000,0.000,0.0000,0.0000,1.0000,0.000

In [49]:
Mode= df3[['Age','Experience','Income','Family','CCAvg','Mortgage',"Personal Loan","Securities Account","CD Account",'Online','CreditCard']].mode()

In [50]:
Mode

,Age,Experience,Income,Family,CCAvg,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,35,32,44,1,0.3,0,0,0,0,1,0

In [75]:
#####################################################################################################################

#### 10. Can you apply any statistical method to observe any similarity in distribution between age and experience variables?

In [58]:
Skewness= df3[['Age','Experience']].skew()
print(Skewness)

Age          -0.029341
Experience   -0.026325
dtype: float64

In [61]:
Kurtosis= df3[['Age','Experience']].kurt()
print(Kurtosis)

Age          -1.153067
Experience   -1.121523
dtype: float64

**Comment:-**
***The skewness is less than -5 for both Age and Experience thus both are negatively skewed. The Kurtosis is also less than 3 for Age and Experience thus there are few outliers in both the variables and both the curves would be platykurtic***

In [76]:
#####################################################################################################################

#### 11. Who are the most frequent family members present in this dataset?

In [37]:
# We can find Most frequent family member using mode
df3['Family'].mode()

0    1
Name: Family, dtype: int64

In [77]:
#####################################################################################################################

#### 12. What is the coefficient of variation you can observe in the ‘Income’ variable?

In [69]:
Mean= df3['Income'].mean()
print(Mean)

Std_Deviation= df3['Income'].std()
print(Std_Deviation)

Coeff_of_Variation= (Std_Deviation/Mean)*100
print("Coeff_of_Variation in percent is",Coeff_of_Variation)

73.7742
46.033729321086334
Coeff_of_Variation in percent is 62.39814097758612

In [78]:
#####################################################################################################################

#### 13. The ‘Mortgage’ variable is having a lot of zeroes. Impute with some business logical value that you feel fit for the data.

In [21]:
df3['Mortgage'].unique()

array([  0, 155, 104, 134, 111, 260, 163, 159,  97, 122, 193, 198, 285,
       412, 153, 211, 207, 240, 455, 112, 336, 132, 118, 174, 126, 236,
       166, 136, 309, 103, 366, 101, 251, 276, 161, 149, 188, 116, 135,
       244, 164,  81, 315, 140,  95,  89,  90, 105, 100, 282, 209, 249,
        91,  98, 145, 150, 169, 280,  99,  78, 264, 113, 117, 325, 121,
       138,  77, 158, 109, 131, 391,  88, 129, 196, 617, 123, 167, 190,
       248,  82, 402, 360, 392, 185, 419, 270, 148, 466, 175, 147, 220,
       133, 182, 290, 125, 124, 224, 141, 119, 139, 115, 458, 172, 156,
       547, 470, 304, 221, 108, 179, 271, 378, 176,  76, 314,  87, 203,
       180, 230, 137, 152, 485, 300, 272, 144,  94, 208, 275,  83, 218,
       327, 322, 205, 227, 239,  85, 160, 364, 449,  75, 107,  92, 187,
       355, 106, 587, 214, 307, 263, 310, 127, 252, 170, 265, 177, 305,
       372,  79, 301, 232, 289, 212, 250,  84, 130, 303, 256, 259, 204,
       524, 157, 231, 287, 247, 333, 229, 357, 361, 294,  86, 329, 142,
       184, 442, 233, 215, 394, 475, 197, 228, 297, 128, 241, 437, 178,
       428, 162, 234, 257, 219, 337, 382, 397, 181, 120, 380, 200, 433,
       222, 483, 154, 171, 146, 110, 201, 277, 268, 237, 102,  93, 354,
       195, 194, 238, 226, 318, 342, 266, 114, 245, 341, 421, 359, 565,
       319, 151, 267, 601, 567, 352, 284, 199,  80, 334, 389, 186, 246,
       589, 242, 143, 323, 535, 293, 398, 343, 255, 311, 446, 223, 262,
       422, 192, 217, 168, 299, 505, 400, 165, 183, 326, 298, 569, 374,
       216, 191, 408, 406, 452, 432, 312, 477, 396, 582, 358, 213, 467,
       331, 295, 235, 635, 385, 328, 522, 496, 415, 461, 344, 206, 368,
       321, 296, 373, 292, 383, 427, 189, 202,  96, 429, 431, 286, 508,
       210, 416, 553, 403, 225, 500, 313, 410, 273, 381, 330, 345, 253,
       258, 351, 353, 308, 278, 464, 509, 243, 173, 481, 281, 306, 577,
       302, 405, 571, 581, 550, 283, 612, 590, 541], dtype=int64)

In [26]:
median_value = df3[df3['Mortgage'] != 0]['Mortgage'].median()
median_value

153.0

In [27]:
df3['Mortgage'] = df3['Mortgage'].replace(0, median_value)

In [28]:
df3

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,153,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,153,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,153,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,153,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,153,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,29,3,40,92697,1,1.9,3,153,0,0,0,1,0
4996,4997,30,4,15,92037,4,0.4,1,85,0,0,0,1,0
4997,4998,63,39,24,93023,2,0.3,3,153,0,0,0,0,0
4998,4999,65,40,49,90034,3,0.5,2,153,0,0,0,1,0
4999,5000,28,4,83,92612,3,0.8,1,153,0,0,0,1,1

In [79]:
#####################################################################################################################

#### 14. Do customers with credit cards have any impact on their experience and income?

In [19]:
New_df= df3[['Experience','Income','CreditCard']]
New_df.head(10)

   Experience  Income  CreditCard
0           1      49           0
1          19      34           0
2          15      11           0
3           9     100           0
4           8      45           1
5          13      29           0
6          27      72           0
7          24      22           1
8          10      81           0
9           9     180           0

In [24]:
grouped = New_df.groupby('CreditCard')
grouped.mean()

            Experience     Income
CreditCard
0            20.038244  73.845042
1            20.263946  73.604082

In [48]:
grouped.median()

            Experience  Income
CreditCard
0                 20.0    63.5
1                 20.0    64.0

**Comment:-**
***As we can see from outputs that mean of the experience and Income for the customers having and not having credit cards are approximately close respectively. Even their medians have just a slight change in their values. Hence according to data, credit card have negligible impact on experience and income.***

In [80]:
#####################################################################################################################

#### 15. Do you see any outliers in the dataset? If yes what plot is suitable to showcase to the stakeholders?

In [20]:
def find_outliers_IQR(df3):

   q1=df3.quantile(0.25)

   q3=df3.quantile(0.75)

   IQR=q3-q1

   outliers = df3[((df3<(q1-1.5*IQR)) | (df3>(q3+1.5*IQR)))]

   return outliers

In [46]:
outliers = find_outliers_IQR(df3)
outliers

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4996,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4997,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4998,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4999,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
outliers = find_outliers_IQR(df3)

print("max outlier value:" + str(outliers.max()))

print("min outlier value:" + str(outliers.min()))

max outlier value:ID                       NaN
Age                      NaN
Experience               NaN
Income                 224.0
ZIP Code              9307.0
Family                   NaN
CCAvg                   10.0
Education                NaN
Mortgage               635.0
Personal Loan            1.0
Securities Account       1.0
CD Account               1.0
Online                   NaN
CreditCard               NaN
dtype: float64
min outlier value:ID                       NaN
Age                      NaN
Experience               NaN
Income                 188.0
ZIP Code              9307.0
Family                   NaN
CCAvg                    5.3
Education                NaN
Mortgage               253.0
Personal Loan            1.0
Securities Account       1.0
CD Account               1.0
Online                   NaN
CreditCard               NaN
dtype: float64

**Comment:-**
***Box plot will be most suitable to showcase outliers to the stakeholders.***

In [81]:
#####################################################################################################################

#### 16. Give us the deciles values of the variable ‘Income’ in the dataset.

In [86]:
deciles = df3['Income'].quantile([0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9])
print(deciles)

0.1     22.0
0.2     33.0
0.3     42.0
0.4     52.0
0.5     64.0
0.6     78.0
0.7     88.3
0.8    113.0
0.9    145.0
Name: Income, dtype: float64

In [82]:
#####################################################################################################################

#### 17. Give the IQR of all the variables which are quantitative and continuous.

In [89]:
def df3_IQR(df3):

   q1=df3.quantile(0.25)

   q3=df3.quantile(0.75)

   IQR=q3-q1

   return IQR

In [92]:
IQR= df3_IQR(df3[['Age','Experience','Income','Family','CCAvg','Mortgage',"Personal Loan"]])
IQR

Age              20.0
Experience       20.0
Income           59.0
Family            2.0
CCAvg             1.8
Mortgage          0.0
Personal Loan     0.0
dtype: float64

In [ ]:
#####################################################################################################################

#### 18. Do the higher-income holders spend more on credit cards?

In [93]:
df3

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,153,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,153,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,153,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,153,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,153,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,29,3,40,92697,1,1.9,3,153,0,0,0,1,0
4996,4997,30,4,15,92037,4,0.4,1,85,0,0,0,1,0
4997,4998,63,39,24,93023,2,0.3,3,153,0,0,0,0,0
4998,4999,65,40,49,90034,3,0.5,2,153,0,0,0,1,0
4999,5000,28,4,83,92612,3,0.8,1,153,0,0,0,1,1

In [96]:
print(df3['Income'].corr(df3['CCAvg']))

0.6459925919173632

In [31]:
grouped_Income = df3.groupby('Income')['CCAvg'].mean()
grouped_Income.tail(15)

Income
191    4.348718
192    3.283333
193    6.366667
194    4.400000
195    4.436667
198    4.155556
199    6.555556
200    6.100000
201    6.920000
202    7.350000
203    9.400000
204    5.366667
205    7.566667
218    6.666667
224    6.666667
Name: CCAvg, dtype: float64

**Comment:-**
***The data shows that there is not such direct relation for higher income makers spends more on credit cards.***

In [ ]:
#####################################################################################################################

#### 19. Do customers using bank internet facilities paid higher?

In [105]:
grouped_Online = df3.groupby('Online')['Income'].mean()

In [106]:
grouped_Online

Online
0    72.978671
1    74.311662
Name: Income, dtype: float64

**Comment:-**
***The data shows that the customers using bank internet facilities are paid slightly higher than those who don't use it.***

#### 20. Calculate the Z score of the ‘income’ variable.

In [83]:
df3['Income_zscore'] = (df3['Income'] - df3['Income'].mean()) / df3['Income'].std()

df3['Income_zscore']

0      -0.538175
1      -0.864023
2      -1.363657
3       0.569708
4      -0.625068
          ...
4995   -0.733684
4996   -1.276764
4997   -1.081255
4998   -0.538175
4999    0.200414
Name: Income_zscore, Length: 5000, dtype: float64

In [ ]:
#####################################################################################################################